package com.example.mytraining

import com.example.training.Exercise
import com.example.training.R

class ExerciseDateBase {
    companion object {
        val exercise = mutableListOf(
            Exercise(
                "push",
                "Поставьте руки на пол на ширине плеч. Опускайте туловище, пока грудь почти не коснется пола. Разгибайте руки полностью, поднимая туловище.",
                2,
                R.drawable.push
            ),
            Exercise(
                "squar",
                "Встаньте, ноги на ширине плеч. Опустите туловище как можно ниже, сгибая ноги в коленях. Вернитесь в исходное положение.",
                2,
                R.drawable.squar
            ),
            Exercise(
                "plank",
                "Примите упор лежа, затем согните руки в локтях и перенесите вес тела на предплечья. Удерживайте это положение отведенное время.",
                2,
                R.drawable.plank
            ),
            Exercise(
                "kickback",
                "Встаньте на одно колено и наклонитесь чуть вперед. Махайте другой ногой назад и вверх, стараясь удержать равновесие.",
                2,
                R.drawable.kickback
            ),
            Exercise(
                "superman",
                "Лягте на живот, вытяните руки вперед. Одновременно поднимите руки и ноги, удерживая тело в напряжении.",
                2,
                R.drawable.superman
            ),
            Exercise(
                "burpee",
                "Из стоячего положения опуститесь в присед, затем в упор лежа, сделайте отжимание и выполните прыжок обратно в присед. Вернитесь в стоячее положение.",
                2,
                R.drawable.burpee
            ),
            Exercise(
                "lunge",
                "Встаньте прямо, сделайте шаг вперед одной ногой и опустите тело, сгибая оба колена. Вернитесь в исходное положение и смените ногу.",
                2,
                R.drawable.lunge
            ),
            Exercise(
                "crunch",
                "Лежа на спине, согните ноги в коленях. Поднимайте верхнюю часть тела, отрывая плечи от полу, а затем возвращайтесь в исходное положение.",
                2,
                R.drawable.crunch
            ),
            Exercise(
                "mountain_climber",
                "Примите упор лежа, поднимите одно колено к груди, затем вернитесь в исходное положение. Попеременно выполняйте это движение с каждой ногой, сохраняйте быстрый темп.",
                2,
                R.drawable.mountain_climber
            ),
            Exercise(
                "side_plank",
                "Лягте на бок, опираясь на одно предплечье. Поднимите таз, чтобы тело образовало прямую линию. Удерживайте позицию, стараясь не прогибаться в пояснице.",
                2,
                R.drawable.side_plank
        )
        )
    }
}